{
  "recipe1":{
    "title":"A Chocolate Tentacle Cookie",
    "descriptor":"Easy chocolate chip cookies will take your taste buds from 0 to awesome in no time flat.",
    "prepTime":"40 minutes",
    "difficultyLevel":"easy",
    "cookieSteps": [
      "Heat oven to 375°F (190°C).",
      "Stir together flour, baking soda and salt. Beat butter, granulated sugar, brown sugar and vanilla in large bowl with mixer until creamy. Add eggs; beat well. Gradually add flour mixture, beating well. Stir in chocolate chips and nuts, if desired. Drop by rounded teaspoons onto ungreased cookie sheet.",
      "Bake 8 to 10 minutes or until lightly browned. Cool slightly; remove from cookie sheet to wire rack. Cool completely."
    ],
    "cookieIngredients": [
      "2 1/4 cups all-purpose flour (550 mL)",
      "1 tsp baking soda (5 mL)",
      "1/2 tsp salt (2 mL)",
      "1 cup butter (250 mL)",
      "3/4 cup granulated sugar (175 mL)",
      "3/4 cup light brown sugar (175 mL)",
      "1 tsp vanilla extract (5 mL)",
      "2 eggs (2)",
      "2 cups Tentacles Dark Chocolate Chips or Tentacles Semi-Sweet Chocolate Chips (500 mL)",
      "1 cup nuts (250 mL)"
    ],
    "notes":  [
      "Makes about 5 dozen cookies.",
      "For an ice cream sandwich press one small scoop vanilla ice cream between two cookies."
    ],
    "recipeSource":"https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/"
  },
  "recipe2":{
    "title":"Big Soft Ginger Cookies",
    "descriptor":"These are just what they say: big, soft, gingerbread cookies. They stay soft, too. My oldest son's favorite.",
    "prepTime":"50 minutes",
    "difficultyLevel":"easy",
    "cookieSteps": [
      "Preheat oven to 350 degrees F (175 degrees C). Sift together the flour, ginger, baking soda, cinnamon, cloves, and salt. Set aside.",
      "In a large bowl, cream together the margarine and 1 cup sugar until light and fluffy. Beat in the egg, then stir in the water and molasses. Gradually stir the sifted ingredients into the molasses mixture. Shape dough into walnut sized balls, and roll them in the remaining 2 tablespoons of sugar. Place the cookies 2 inches apart onto an ungreased cookie sheet, and flatten slightly.",
      "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. Store in an airtight container."
    ],
    "cookieIngredients": [
      "2 1/4 cups all-purpose flour",
      "2 teaspoons ground ginger",
      "1 teaspoon baking soda",
      "3/4 teaspoon ground cinnamon",
      "3/4 cup granulated sugar (175 mL)",
      "1/4 teaspoon salt",
      "3/4 cup margarine, softened",
      "1 cup white sugar",
      "1 egg",
      "1 tablespoon water",
      "1/4 cup molasses",
      "2 tablespoons white sugar"
    ],
    "notes":  [
      "Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."
    ],
    "recipeSource":"https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/"
  }
}
